nvme0n1_fio_results/dev-nvme0n1_2023-07-17_16:05/rand_w_nvme0n1_2iodepth_1threads/2048.txt
rand-write: (g=0): rw=randwrite, bs=(R) 2048KiB-2048KiB, (W) 2048KiB-2048KiB, (T) 2048KiB-2048KiB, ioengine=libaio, iodepth=2
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nvme0n1 failed: Permission denied

rand-write: (groupid=0, jobs=1): err= 0: pid=4464: Mon Jul 17 16:11:55 2023
  write: IOPS=1175, BW=2351MiB/s (2465MB/s)(45.9GiB/20001msec)
    slat (usec): min=58, max=734, avg=131.87, stdev=39.12
    clat (usec): min=339, max=31862, avg=1566.86, stdev=1351.22
     lat (usec): min=433, max=31991, avg=1699.01, stdev=1348.87
    clat percentiles (usec):
     |  1.00th=[  465],  5.00th=[  619], 10.00th=[  742], 20.00th=[  922],
     | 30.00th=[ 1106], 40.00th=[ 1270], 50.00th=[ 1385], 60.00th=[ 1500],
     | 70.00th=[ 1631], 80.00th=[ 1844], 90.00th=[ 2057], 95.00th=[ 2245],
     | 99.00th=[ 8291], 99.50th=[ 9765], 99.90th=[15533], 99.95th=[19268],
     | 99.99th=[30802]
   bw (  MiB/s): min= 1992, max= 2504, per=100.00%, avg=2351.10, stdev=130.95, samples=40
   iops        : min=  996, max= 1252, avg=1175.55, stdev=65.47, samples=40
  lat (usec)   : 500=2.03%, 750=8.54%, 1000=13.76%
  lat (msec)   : 2=62.29%, 4=10.22%, 10=2.70%, 20=0.40%, 50=0.04%
  cpu          : usr=8.09%, sys=8.79%, ctx=22099, majf=0, minf=1624
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,23513,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
  WRITE: bw=2351MiB/s (2465MB/s), 2351MiB/s-2351MiB/s (2465MB/s-2465MB/s), io=45.9GiB (49.3GB), run=20001-20001msec

Disk stats (read/write):
  nvme0n1: ios=43/374176, merge=0/0, ticks=3/467270, in_queue=447900, util=99.42%