nvme0n1_fio_results/dev-nvme0n1_2023-07-17_16:05/rand_w_nvme0n1_2iodepth_1threads/4096.txt
rand-write: (g=0): rw=randwrite, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=2
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nvme0n1 failed: Permission denied

rand-write: (groupid=0, jobs=1): err= 0: pid=4506: Mon Jul 17 16:12:15 2023
  write: IOPS=609, BW=2439MiB/s (2557MB/s)(47.6GiB/20002msec)
    slat (usec): min=113, max=865, avg=226.69, stdev=66.30
    clat (usec): min=703, max=16352, avg=3051.17, stdev=1386.58
     lat (usec): min=1012, max=16556, avg=3278.13, stdev=1380.20
    clat percentiles (usec):
     |  1.00th=[  947],  5.00th=[ 1287], 10.00th=[ 1926], 20.00th=[ 2540],
     | 30.00th=[ 2704], 40.00th=[ 2802], 50.00th=[ 2900], 60.00th=[ 2999],
     | 70.00th=[ 3130], 80.00th=[ 3294], 90.00th=[ 3818], 95.00th=[ 4883],
     | 99.00th=[ 9634], 99.50th=[11600], 99.90th=[13435], 99.95th=[14091],
     | 99.99th=[15664]
   bw (  MiB/s): min= 2368, max= 2512, per=99.98%, avg=2438.16, stdev=34.68, samples=40
   iops        : min=  592, max=  628, avg=609.50, stdev= 8.66, samples=40
  lat (usec)   : 750=0.01%, 1000=1.82%
  lat (msec)   : 2=8.93%, 4=81.00%, 10=7.31%, 20=0.93%
  cpu          : usr=6.93%, sys=7.45%, ctx=11947, majf=0, minf=1069
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,12194,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
  WRITE: bw=2439MiB/s (2557MB/s), 2439MiB/s-2439MiB/s (2557MB/s-2557MB/s), io=47.6GiB (51.1GB), run=20002-20002msec

Disk stats (read/write):
  nvme0n1: ios=43/387987, merge=0/0, ticks=3/898149, in_queue=878309, util=99.58%